docs/site/grew14_guide_elect_acous_perfor_acous_obois.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>grew14_guide_elect_acous_perfor_acous_obois</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">grew14_guide_elect_acous_perfor_acous_obois</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org47a13f5">Guide to Electro-acoustic Performance on Acoustic Oboe</a>
<ul>
<li><a href="#org373d16e">Varese quote</a></li>
<li><a href="#org5269da8">Rep needs upgrades</a></li>
<li><a href="#orgf859e85">Composer reception</a></li>
<li><a href="#org4ac056b">Mic Details</a></li>
<li><a href="#org096d85e">Dress Rehearsal considerations</a></li>
<li><a href="#orgd46afa0">Issues of foot pedals</a></li>
<li><a href="#org3a51a73">Max pieces</a></li>
<li><a href="#org74aa06e">Double Reeds</a></li>
<li><a href="#org725267a">Pictures</a></li>
<li><a href="#org0f4621e">Learning Curve</a></li>
<li><a href="#org3f9367e">Fun!</a></li>
<li><a href="#org9bb9338">Polar Patterns</a></li>
<li><a href="#org42b779e">Mic types</a></li>
<li><a href="#org0d88b1f">Condenser</a></li>
<li><a href="#orgd49a57b">Contact Microphone</a></li>
<li><a href="#orgf3537e7">Feedback</a></li>
<li><a href="#org36161f0">Line Noise</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org47a13f5" class="outline-2">
<h2 id="org47a13f5">Guide to Electro-acoustic Performance on Acoustic Oboe</h2>
<div class="outline-text-2" id="text-org47a13f5">
</div>
<div id="outline-container-org373d16e" class="outline-3">
<h3 id="org373d16e">Varese quote</h3>
<div class="outline-text-3" id="text-org373d16e">
<p>
Electronics are not meant to replace the old musical instruments which composers, including myself, will continue to use. Electronics is an additive, not a destructive factor in the art and science of music. (From varese and Wen-chung "The Liberation of Sound" Perspectives of New Music Vol 5 No 1 pp 15
</p>
</div>
</div>
<div id="outline-container-org5269da8" class="outline-3">
<h3 id="org5269da8">Rep needs upgrades</h3>
<div class="outline-text-3" id="text-org5269da8">
<p>
The electronic repertoire requires frequent technological upgrade for survival.
</p>
</div>
</div>
<div id="outline-container-orgf859e85" class="outline-3">
<h3 id="orgf859e85">Composer reception</h3>
<div class="outline-text-3" id="text-orgf859e85">
<p>
Some composers are more willing than others to update their pieces for a performance
</p>
</div>
</div>
<div id="outline-container-org4ac056b" class="outline-3">
<h3 id="org4ac056b">Mic Details</h3>
<div class="outline-text-3" id="text-org4ac056b">
<p>
Detailed about chords etc with microphones
</p>
</div>
</div>
<div id="outline-container-org096d85e" class="outline-3">
<h3 id="org096d85e">Dress Rehearsal considerations</h3>
<div class="outline-text-3" id="text-org096d85e">
<p>
Which equipment is the performer providing and what is the venue providing? 
</p>
</div>
</div>
<div id="outline-container-orgd46afa0" class="outline-3">
<h3 id="orgd46afa0">Issues of foot pedals</h3>
<div class="outline-text-3" id="text-orgd46afa0">
<p>
They visually give away the fact that the computer is going to do something. Sometimes they can be noisy. They can also add a physical restraint.
</p>
</div>
</div>
<div id="outline-container-org3a51a73" class="outline-3">
<h3 id="org3a51a73">Max pieces</h3>
<div class="outline-text-3" id="text-org3a51a73">
<p>
Composers take effort to not make their patches hard to use. They know if it isn't user friendly that performers will stop there.
</p>
</div>
</div>
<div id="outline-container-org74aa06e" class="outline-3">
<h3 id="org74aa06e">Double Reeds</h3>
<div class="outline-text-3" id="text-org74aa06e">
<p>
It's possible pieces listening for specific notes can misfire with double reeds because of the differences in reeds.
</p>

<p>
Sometimes it may be better to have someone running the patch.
</p>
</div>
</div>
<div id="outline-container-org725267a" class="outline-3">
<h3 id="org725267a">Pictures</h3>
<div class="outline-text-3" id="text-org725267a">
<p>
At the end of a rehearsal take pictures of the knobs and settings to not lose the work.
</p>
</div>
</div>
<div id="outline-container-org0f4621e" class="outline-3">
<h3 id="org0f4621e">Learning Curve</h3>
<div class="outline-text-3" id="text-org0f4621e">
<p>
With live processing the performer needs to be familiar enough with equipment to diagnose the problem quickly. Perhaps have a few stories and jokes prepared in case it takes a while to fix.
</p>
</div>
</div>
<div id="outline-container-org3f9367e" class="outline-3">
<h3 id="org3f9367e">Fun!</h3>
<div class="outline-text-3" id="text-org3f9367e">
<p>
It is fun playing with live processing!
</p>
</div>
</div>
<div id="outline-container-org9bb9338" class="outline-3">
<h3 id="org9bb9338">Polar Patterns</h3>
<div class="outline-text-3" id="text-org9bb9338">
<p>
Omnidirectional is probably not a good choice as it will pickup the audience.
Figure 8 likewise is not ideal for an acoustic instrument.
Hyper cardioid could be good if you want to capture some of the reverb, but not necessarily for a signal for processing 
Cardioid is probablye best for isolating a signal
</p>
</div>
</div>
<div id="outline-container-org42b779e" class="outline-3">
<h3 id="org42b779e">Mic types</h3>
<div class="outline-text-3" id="text-org42b779e">
<p>
Ribbon is usually bidirectional, so may not be the best choice. However they are good for bass frequencies, and roll off at 14hz (not really a problem for bassoon like it is with oboe) 
Dynamic is cheap, and works well in close quarters, but probably sacrifices the sound
</p>
</div>
</div>
<div id="outline-container-org0d88b1f" class="outline-3">
<h3 id="org0d88b1f">Condenser</h3>
<div class="outline-text-3" id="text-org0d88b1f">
<p>
Condensers capture frequencies the best, but require phantom power (or a pp box) and are a little more expensive
</p>
</div>
</div>
<div id="outline-container-orgd49a57b" class="outline-3">
<h3 id="orgd49a57b">Contact Microphone</h3>
<div class="outline-text-3" id="text-orgd49a57b">
<p>
Convenience of not worrying about proximity to the mic. They are often wireless.
They do add batteries, and weight.
</p>
</div>
</div>
<div id="outline-container-orgf3537e7" class="outline-3">
<h3 id="orgf3537e7">Feedback</h3>
<div class="outline-text-3" id="text-orgf3537e7">
<p>
Feedback is the biggest issue with microphones. Usually it is because of the monitor's proximity to the mic
</p>
</div>
</div>
<div id="outline-container-org36161f0" class="outline-3">
<h3 id="org36161f0">Line Noise</h3>
<div class="outline-text-3" id="text-org36161f0">
<p>
Sound cables and electric cables may need to be separated if the cables aren't isolated.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
